# 爬取平台选择 xhs dy ks bili wb tieba zhihu
抓取平台 = "bili"

# 爬取类型 search(关键词搜索) | detail(帖子详情)| creator(创作者主页数据)
抓取类型 = "detail"

# 关键词搜索配置，以英文逗号分隔
关键词查询 = "编程副业,编程兼职"


################################################################### 下面是需要抓取的数据配置 ###################################################################


# 指定小红书需要爬虫的笔记URL列表, 目前要携带xsec_token和xsec_source参数
小红书笔记 = [
    "https://www.xiaohongshu.com/explore/66fad51c000000001b0224b8?xsec_token=AB3rO-QopW5sgrJ41GwN01WCXh6yWPxjSoFI9D5JIMgKw=&xsec_source=pc_search"
]

# 指定抖音需要爬取的ID列表
抖音 = [
    "7280854932641664319",
    "7202432992642387233",
]

# 指定快手平台需要爬取的ID列表
快手 = ["3xf8enb8dbj6uig", "3x6zz972bchmvqe"]

# 指定B站平台需要爬取的视频bvid列表
哔哩哔哩 = [
    "BV1L891YbEjF",
]

# 指定微博平台需要爬取的帖子列表
微博 = [
    "P5UuVl48G",
    # ........................
]

# 指定weibo创作者ID列表
微博作者 = [
    "5533390220",
    # ........................
]

# 指定贴吧需要爬取的帖子列表
贴吧 = []

# 指定贴吧名称列表，爬取该贴吧下的帖子
贴吧名称 = [
    # "盗墓笔记"
]

# 指定贴吧创作者URL列表
贴吧作者 = [
    "https://tieba.baidu.com/home/main/?id=tb.1.7f139e2e.6CyEwxu3VJruH_-QqpCi6g&fr=frs",
    # ........................
]

# 指定小红书创作者ID列表
小红书作者 = [
    "63e36c9a000000002703502b",
    # ........................
]

# 指定Dy创作者ID列表(sec_id)
抖音作者 = [
    "MS4wLjABAAAATJPY7LAlaa5X-c8uNdWkvz0jUGgpw4eeXIwu_8BhvqE",
    # ........................
]

# 指定bili创作者ID列表(sec_id)
B站作者 = [
    "20813884",
    # ........................
]

# 指定快手创作者ID列表
快手作者 = [
    "3x4sm73aye7jq7i",
    # ........................
]
